       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
         01 WS-YEAR PIC 9999.
         01 WS-IGNORE PIC 9(9).
         01 WS-400 PIC 999.
         01 WS-100 PIC 999.
         01 WS-4   PIC 999.
         01 WS-RESULT PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       LEAP.
         DIVIDE WS-YEAR BY 400 GIVING WS-IGNORE REMAINDER WS-400.
         DIVIDE WS-YEAR BY 100 GIVING WS-IGNORE REMAINDER WS-100.
         DIVIDE WS-YEAR BY   4 GIVING WS-IGNORE REMAINDER WS-4.

         IF WS-4 IS ZERO THEN
            MOVE 1 TO WS-RESULT
         END-IF.

         IF WS-100 IS ZERO THEN
            MOVE 0 TO WS-RESULT
         END-IF.
      
         IF WS-400 IS ZERO THEN
            MOVE 1 TO WS-RESULT
         END-IF.
      
       LEAP-EXIT.
         EXIT.
