       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
         01 WS-YEAR PIC 9999.
         01 WS-CONSTANTS.
            05 WS-LEAP-CONSTANTS.
               10 WS-LEAP-YEAR PIC 9 VALUE 4.
               10 WS-NORMAL-CENTURY PIC 999 VALUE 100.
               10 WS-LEAP-CENTURY PIC 999 VALUE 400.
            05 WS-STATUS.
               10 WS-IS-LEAP PIC 9 VALUE 1.
               10 WS-NOT-LEAP PIC 9 VALUE 0.
         01 WS-RESULT PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       LEAP.
         EVALUATE TRUE
            WHEN FUNCTION MOD(WS-YEAR, WS-LEAP-YEAR) IS NOT ZERO
               MOVE WS-NOT-LEAP TO WS-RESULT
            WHEN FUNCTION MOD(WS-YEAR, WS-NORMAL-CENTURY) IS NOT ZERO
               MOVE WS-IS-LEAP TO WS-RESULT
            WHEN FUNCTION MOD(WS-YEAR, WS-LEAP-CENTURY) IS ZERO
               MOVE WS-IS-LEAP TO WS-RESULT
            WHEN OTHER
               MOVE WS-NOT-LEAP TO WS-RESULT
         END-EVALUATE.
      
       LEAP-EXIT.
         EXIT.
