       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
         78 WS-IS-LEAP VALUE 1.
         78 WS-NOT-LEAP VALUE 0.
         01 WS-YEAR PIC 9(4).
         01 WS-RESULT PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       LEAP.
         EVALUATE TRUE
            WHEN FUNCTION MOD(WS-YEAR, 4) IS NOT ZERO
               MOVE WS-NOT-LEAP TO WS-RESULT
            WHEN FUNCTION MOD(WS-YEAR, 100) IS NOT ZERO
               MOVE WS-IS-LEAP TO WS-RESULT
            WHEN FUNCTION MOD(WS-YEAR, 400) IS ZERO
               MOVE WS-IS-LEAP TO WS-RESULT
            WHEN OTHER
               MOVE WS-NOT-LEAP TO WS-RESULT
         END-EVALUATE.
      
       LEAP-EXIT.
         EXIT.
